// 함수의 선언, 매개변수 a
function makeAlt(a){
    alert(a);
}

/* 방법 1 */
makeAlt("hi");
/* 방법 2 */
makeAlt("Hello");
/* 방법 3 */
var a = "hello";
makeAlt(a);

/*

[ 산술 연산자 ]
 +, -, *, /, %

[ 문자열 겹합 연산자 ]

"가나다" + "ABC" = "가나다ABC"
문자 + 문자 --> 문자
문자 + 숫자 --> 문자
숫자 + 문자 --> 문자
숫자 + 숫자 --> 숫자(덧셈)

[ 비교 연산자 ]
>, <, >=, <=, ==, ===, !=, !==

==와 ===의 차이는 ===는 타입까지 일치하는지 검증한다는 것임
!=과 !==도 동일하다

[ 논리 연산자 ]
&& and, || or, ! not

[ 조건(삼항) 연산자 ]
조건식 ? 값1 : 값2
조건식이 참이라면 값1 그렇지 않다면 값2를 가지게 된다

[ 대입 연산자 ]
=, +=, -=, *=, /=, %=

[ 증감 연산자 ]
++, --


*/



